{
  "word2id": {
    "pad": 0,
    "unk": 1,
    "what": 2,
    "is": 3,
    "the": 4,
    "cost": 5,
    "for": 6,
    "these": 7,
    "flights": 8,
    "from": 9,
    "baltimore": 10,
    "to": 11,
    "philadelphia": 12,
    "westchester": 13,
    "county": 14,
    "san": 15,
    "francisco": 16,
    "daily": 17,
    "i": 18,
    "would": 19,
    "like": 20,
    "a": 21,
    "flight": 22,
    "dallas": 23,
    "on": 24,
    "american": 25,
    "airlines": 26,
    "can": 27,
    "take": 28,
    "single": 29,
    "airline": 30,
    "la": 31,
    "charlotte": 32,
    "newark": 33,
    "back": 34,
    "earliest": 35,
    "oakland": 36,
    "washington": 37,
    "dc": 38,
    "sunday": 39,
    "'d": 40,
    "book": 41,
    "columbus": 42,
    "nashville": 43,
    "please": 44,
    "denver": 45,
    "pittsburgh": 46,
    "show": 47,
    "me": 48,
    "round": 49,
    "trip": 50,
    "tickets": 51,
    "new": 52,
    "york": 53,
    "miami": 54,
    "phoenix": 55,
    "las": 56,
    "vegas": 57,
    "find": 58,
    "cheapest": 59,
    "fare": 60,
    "atlanta": 61,
    "'s": 62,
    "latest": 63,
    "get": 64,
    "boston": 65,
    "arrival": 66,
    "in": 67,
    "salt": 68,
    "lake": 69,
    "city": 70,
    "of": 71,
    "toronto": 72,
    "list": 73,
    "nonstop": 74,
    "along": 75,
    "with": 76,
    "fares": 77,
    "that": 78,
    "are": 79,
    "less": 80,
    "than": 81,
    "466": 82,
    "dollars": 83,
    "all": 84,
    "between": 85,
    "and": 86,
    "coach": 87,
    "saturday": 88,
    "pm": 89,
    "continental": 90,
    "leaving": 91,
    "chicago": 92,
    "morning": 93,
    "hi": 94,
    "'m": 95,
    "calling": 96,
    "make": 97,
    "either": 98,
    "orlando": 99,
    "or": 100,
    "los": 101,
    "angeles": 102,
    "us": 103,
    "air": 104,
    "cleveland": 105,
    "arrives": 106,
    "around": 107,
    "10": 108,
    "o'clock": 109,
    "evening": 110,
    "need": 111,
    "lowest": 112,
    "give": 113,
    "memphis": 114,
    "time": 115,
    "zone": 116,
    "does": 117,
    "abbreviation": 118,
    "ua": 119,
    "mean": 120,
    "one": 121,
    "way": 122,
    "ground": 123,
    "transportation": 124,
    "available": 125,
    "at": 126,
    "airport": 127,
    "tacoma": 128,
    "jose": 129,
    "houston": 130,
    "will": 131,
    "car": 132,
    "twa": 133,
    "united": 134,
    "fly": 135,
    "fort": 136,
    "worth": 137,
    "leaves": 138,
    "after": 139,
    "8": 140,
    "going": 141,
    "november": 142,
    "seventh": 143,
    "monday": 144,
    "seating": 145,
    "capacity": 146,
    "f28": 147,
    "seattle": 148,
    "classes": 149,
    "service": 150,
    "provide": 151,
    "anywhere": 152,
    "arriving": 153,
    "2100": 154,
    "information": 155,
    "departing": 156,
    "thursday": 157,
    "before": 158,
    "9": 159,
    "am": 160,
    "dl": 161,
    "217": 162,
    "there": 163,
    "any": 164,
    "using": 165,
    "j31": 166,
    "aircraft": 167,
    "meal": 168,
    "milwaukee": 169,
    "wednesday": 170,
    "night": 171,
    "tuesday": 172,
    "afternoon": 173,
    "flying": 174,
    "want": 175,
    "see": 176,
    "you": 177,
    "delta": 178,
    "an": 179,
    "stopover": 180,
    "say": 181,
    "about": 182,
    "mealtime": 183,
    "arrive": 184,
    "noon": 185,
    "3": 186,
    "which": 187,
    "go": 188,
    "stop": 189,
    "making": 190,
    "both": 191,
    "direct": 192,
    "connecting": 193,
    "kansas": 194,
    "burbank": 195,
    "may": 196,
    "twenty": 197,
    "two": 198,
    "depart": 199,
    "7": 200,
    "could": 201,
    "general": 202,
    "mitchell": 203,
    "international": 204,
    "downtown": 205,
    "through": 206,
    "code": 207,
    "ff": 208,
    "next": 209,
    "do": 210,
    "747": 211,
    "first": 212,
    "into": 213,
    "march": 214,
    "last": 215,
    "restriction": 216,
    "ap": 217,
    "57": 218,
    "leave": 219,
    "early": 220,
    "tell": 221,
    "'ll": 222,
    "rent": 223,
    "know": 224,
    "price": 225,
    "class": 226,
    "seats": 227,
    "nw": 228,
    "weekday": 229,
    "indianapolis": 230,
    "5": 231,
    "6": 232,
    "so": 233,
    "when": 234,
    "have": 235,
    "maximum": 236,
    "amount": 237,
    "still": 238,
    "return": 239,
    "same": 240,
    "day": 241,
    "1700": 242,
    "only": 243,
    "weekdays": 244,
    "love": 245,
    "field": 246,
    "plane": 247,
    "grounds": 248,
    "st.": 249,
    "louis": 250,
    "paul": 251,
    "distance": 252,
    "guardia": 253,
    "prices": 254,
    "most": 255,
    "expensive": 256,
    "detroit": 257,
    "friday": 258,
    "qx": 259,
    "jersey": 260,
    "ap80": 261,
    "serves": 262,
    "august": 263,
    "sixth": 264,
    "where": 265,
    "each": 266,
    "1000": 267,
    "tampa": 268,
    "april": 269,
    "june": 270,
    "economy": 271,
    "thirty": 272,
    "number": 273,
    "again": 274,
    "dinner": 275,
    "looking": 276,
    "diego": 277,
    "1": 278,
    "now": 279,
    "fourth": 280,
    "breakfast": 281,
    "via": 282,
    "tomorrow": 283,
    "qo": 284,
    "no": 285,
    "week": 286,
    "lunch": 287,
    "hou": 288,
    "ac": 289,
    "as": 290,
    "explain": 291,
    "q": 292,
    "long": 293,
    "beach": 294,
    "how": 295,
    "many": 296,
    "yn": 297,
    "okay": 298,
    "just": 299,
    "takeoffs": 300,
    "landings": 301,
    "july": 302,
    "eighth": 303,
    "philly": 304,
    "ninth": 305,
    "serving": 306,
    "california": 307,
    "serve": 308,
    "12": 309,
    "4": 310,
    "fourteenth": 311,
    "makes": 312,
    "wednesdays": 313,
    "another": 314,
    "cincinnati": 315,
    "times": 316,
    "later": 317,
    "interested": 318,
    "should": 319,
    "be": 320,
    "kind": 321,
    "airplane": 322,
    "281": 323,
    "bwi": 324,
    "second": 325,
    "petersburg": 326,
    "types": 327,
    "today": 328,
    "colorado": 329,
    "pennsylvania": 330,
    "then": 331,
    "eleventh": 332,
    "more": 333,
    "stops": 334,
    "provided": 335,
    "by": 336,
    "travel": 337,
    "mia": 338,
    "but": 339,
    "ontario": 340,
    "limo": 341,
    "out": 342,
    "taxi": 343,
    "operation": 344,
    "230": 345,
    "texas": 346,
    "my": 347,
    "choices": 348,
    "your": 349,
    "1059": 350,
    "minneapolis": 351,
    "schedule": 352,
    "ticket": 353,
    "least": 354,
    "october": 355,
    "fifteenth": 356,
    "used": 357,
    "1222": 358,
    "america": 359,
    "west": 360,
    "southwest": 361,
    "sorry": 362,
    "271": 363,
    "hp": 364,
    "tower": 365,
    "fifth": 366,
    "restrictions": 367,
    "airfare": 368,
    "416": 369,
    "trying": 370,
    "eastern": 371,
    "838": 372,
    "1100": 373,
    "days": 374,
    "goes": 375,
    "sfo": 376,
    "ewr": 377,
    "december": 378,
    "sixteenth": 379,
    "if": 380,
    "possible": 381,
    "northwest": 382,
    "transport": 383,
    "live": 384,
    "montreal": 385,
    "home": 386,
    "numbers": 387,
    "six": 388,
    "qw": 389,
    "september": 390,
    "far": 391,
    "it": 392,
    "booking": 393,
    "k": 394,
    "415": 395,
    "other": 396,
    "airports": 397,
    "meals": 398,
    "services": 399,
    "cities": 400,
    "served": 401,
    "nationair": 402,
    "stopping": 403,
    "2": 404,
    "third": 405,
    "730": 406,
    "rental": 407,
    "rates": 408,
    "tenth": 409,
    "reaching": 410,
    "arrangements": 411,
    "stands": 412,
    "total": 413,
    "thank": 414,
    "sixteen": 415,
    "late": 416,
    "b": 417,
    "business": 418,
    "mco": 419,
    "stand": 420,
    "type": 421,
    "during": 422,
    "much": 423,
    "bay": 424,
    "area": 425,
    "lufthansa": 426,
    "1991": 427,
    "jet": 428,
    "run": 429,
    "jfk": 430,
    "shortest": 431,
    "without": 432,
    "720": 433,
    "smallest": 434,
    "flies": 435,
    "eight": 436,
    "limousine": 437,
    "thirtieth": 438,
    "mornings": 439,
    "645": 440,
    "thrift": 441,
    "month": 442,
    "departure": 443,
    "f": 444,
    "saturdays": 445,
    "right": 446,
    "c": 447,
    "takes": 448,
    "landing": 449,
    "823": 450,
    "124": 451,
    "402": 452,
    "fine": 453,
    "difference": 454,
    "costs": 455,
    "level": 456,
    "kinds": 457,
    "755": 458,
    "originate": 459,
    "destination": 460,
    "greatest": 461,
    "logan": 462,
    "seventeen": 463,
    "located": 464,
    "oak": 465,
    "atl": 466,
    "630": 467,
    "meaning": 468,
    "start": 469,
    "thanks": 470,
    "also": 471,
    "eighteenth": 472,
    "twelfth": 473,
    "boeing": 474,
    "737": 475,
    "display": 476,
    "laying": 477,
    "over": 478,
    "include": 479,
    "able": 480,
    "put": 481,
    "january": 482,
    "1992": 483,
    "h": 484,
    "heading": 485,
    "ls": 486,
    "different": 487,
    "offers": 488,
    "rentals": 489,
    "plan": 490,
    "codes": 491,
    "airplanes": 492,
    "name": 493,
    "options": 494,
    "noontime": 495,
    "has": 496,
    "canada": 497,
    "layover": 498,
    "trips": 499,
    "nineteenth": 500,
    "they": 501,
    "fn": 502,
    "across": 503,
    "this": 504,
    "continent": 505,
    "m80": 506,
    "cheap": 507,
    "coming": 508,
    "819": 509,
    "within": 510,
    "201": 511,
    "343": 512,
    "florida": 513,
    "schedules": 514,
    "aa": 515,
    "459": 516,
    "midnight": 517,
    "934": 518,
    "rate": 519,
    "hello": 520,
    "inform": 521,
    "sometime": 522,
    "1039": 523,
    "1024": 524,
    "currently": 525,
    "returning": 526,
    "co": 527,
    "continuing": 528,
    "buy": 529,
    "near": 530,
    "430": 531,
    "530": 532,
    "twentieth": 533,
    "arrange": 534,
    "friends": 535,
    "people": 536,
    "uses": 537,
    "wanted": 538,
    "let": 539,
    "iah": 540,
    "some": 541,
    "sure": 542,
    "determine": 543,
    "use": 544,
    "minnesota": 545,
    "852": 546,
    "80": 547,
    "economic": 548,
    "825": 549,
    "555": 550,
    "staying": 551,
    "hours": 552,
    "traveling": 553,
    "1145": 554,
    "their": 555,
    "following": 556,
    "local": 557,
    "equal": 558,
    "270": 559,
    "north": 560,
    "carolina": 561,
    "1115": 562,
    "1245": 563,
    "town": 564,
    "midwest": 565,
    "express": 566,
    "canadian": 567,
    "stopovers": 568,
    "requesting": 569,
    "here": 570,
    "11": 571,
    "offer": 572,
    "regarding": 573,
    "bring": 574,
    "up": 575,
    "turboprop": 576,
    "originating": 577,
    "order": 578,
    "yes": 579,
    "225": 580,
    "1158": 581,
    "equipment": 582,
    "arizona": 583,
    "arrivals": 584,
    "starting": 585,
    "names": 586,
    "1291": 587,
    "1220": 588,
    "snack": 589,
    "great": 590,
    "too": 591,
    "we": 592,
    "'re": 593,
    "nighttime": 594,
    "while": 595,
    "reservation": 596,
    "dfw": 597,
    "734": 598,
    "highest": 599,
    "130": 600,
    "connect": 601,
    "98": 602,
    "kindly": 603,
    "813": 604,
    "straight": 605,
    "110": 606,
    "y": 607,
    "look": 608,
    "listing": 609,
    "earlier": 610,
    "1017": 611,
    "2134": 612,
    "300": 613,
    "400": 614,
    "connections": 615,
    "seven": 616,
    "must": 617,
    "1026": 618,
    "approximately": 619,
    "cp": 620,
    "reservations": 621,
    "capacities": 622,
    "planes": 623,
    "february": 624,
    "twelve": 625,
    "nights": 626,
    "ea": 627,
    "212": 628,
    "100": 629,
    "nonstops": 630,
    "296": 631,
    "324": 632,
    "missouri": 633,
    "utah": 634,
    "those": 635,
    "210": 636,
    "very": 637,
    "help": 638,
    "provides": 639,
    "ohio": 640,
    "106": 641,
    "soon": 642,
    "tuesdays": 643,
    "stapleton": 644,
    "71": 645,
    "repeating": 646,
    "define": 647,
    "ord": 648,
    "269": 649,
    "1600": 650,
    "quebec": 651,
    "describe": 652,
    "red": 653,
    "eye": 654,
    "tonight": 655,
    "ap68": 656,
    "845": 657,
    "dc10": 658,
    "dulles": 659,
    "767": 660,
    "1993": 661,
    "'ve": 662,
    "got": 663,
    "somebody": 664,
    "else": 665,
    "who": 666,
    "wants": 667,
    "305": 668,
    "s": 669,
    "designate": 670,
    "seventeenth": 671,
    "concerning": 672,
    "eleven": 673,
    "carried": 674,
    "under": 675,
    "771": 676,
    "begins": 677,
    "lands": 678,
    "55": 679,
    "summer": 680,
    "overnight": 681,
    "spend": 682,
    "lastest": 683,
    "three": 684,
    "650": 685,
    "itinerary": 686,
    "departs": 687,
    "qualify": 688,
    "417": 689,
    "150": 690,
    "2153": 691,
    "cars": 692,
    "1300": 693,
    "repeat": 694,
    "represented": 695,
    "database": 696,
    "four": 697,
    "257": 698,
    "oh": 699,
    "ten": 700,
    "thursdays": 701,
    "329": 702,
    "ap57": 703,
    "0900": 704,
    "815": 705,
    "cover": 706,
    "minimum": 707,
    "connection": 708,
    "intercontinental": 709,
    "planning": 710,
    "fit": 711,
    "72s": 712,
    "420": 713,
    "georgia": 714,
    "serviced": 715,
    "question": 716,
    "thereafter": 717,
    "travels": 718,
    "73s": 719,
    "everywhere": 720,
    "sd": 721,
    "d": 722,
    "advertises": 723,
    "having": 724,
    "3357": 725,
    "705": 726,
    "thing": 727,
    "bur": 728,
    "taking": 729,
    "off": 730,
    "passengers": 731,
    "hold": 732,
    "500": 733,
    "airfares": 734,
    "4400": 735,
    "year": 736,
    "932": 737,
    "757": 738,
    "abbreviations": 739,
    "19": 740,
    "wish": 741,
    "discount": 742,
    "date": 743,
    "497766": 744,
    "1020": 745,
    "21": 746,
    "beginning": 747,
    "doesn": 748,
    "'t": 749,
    "sa": 750,
    "close": 751,
    "departures": 752,
    "carries": 753,
    "733": 754,
    "311": 755,
    "priced": 756,
    "midway": 757,
    "indiana": 758,
    "279": 759,
    "137338": 760,
    "nevada": 761,
    "non": 762,
    "alaska": 763,
    "1110": 764,
    "718": 765,
    "various": 766,
    "746": 767,
    "d9s": 768,
    "1940": 769,
    "listed": 770,
    "1055": 771,
    "405": 772,
    "scheduled": 773,
    "usa": 774,
    "such": 775,
    "615": 776,
    "land": 777,
    "sundays": 778,
    "prefer": 779,
    "d10": 780,
    "o": 781,
    "'hare": 782,
    "fridays": 783,
    "dinnertime": 784,
    "bound": 785,
    "well": 786,
    "try": 787,
    "1205": 788,
    "train": 789,
    "being": 790,
    "actually": 791,
    "445": 792,
    "515": 793,
    "takeoff": 794,
    "seat": 795,
    "preferably": 796,
    "directly": 797,
    "82": 798,
    "139": 799,
    "visit": 800,
    "them": 801,
    "lives": 802,
    "1045": 803,
    "enroute": 804,
    "largest": 805,
    "m": 806,
    "428": 807,
    "transcontinental": 808,
    "anything": 809,
    "listings": 810,
    "come": 811,
    "lester": 812,
    "pearson": 813,
    "longest": 814,
    "michigan": 815,
    "1765": 816,
    "352": 817,
    "toward": 818,
    "companies": 819,
    "vicinity": 820,
    "connects": 821,
    "supper": 822,
    "505": 823,
    "163": 824,
    "hopefully": 825,
    "928": 826,
    "final": 827,
    "thirteenth": 828,
    "besides": 829,
    "1850": 830,
    "symbols": 831,
    "limousines": 832,
    "route": 833,
    "once": 834,
    "includes": 835,
    "323": 836,
    "229": 837,
    "runs": 838,
    "1133": 839,
    "43": 840,
    "315": 841,
    "bna": 842,
    "1505": 843,
    "3724": 844,
    "reaches": 845,
    "including": 846,
    "afternoons": 847,
    "working": 848,
    "scenario": 849,
    "727": 850,
    "1500": 851,
    "539": 852,
    "trans": 853,
    "world": 854,
    "1030": 855,
    "1130": 856,
    "tennessee": 857,
    "sounds": 858,
    "reverse": 859,
    "sort": 860,
    "afterwards": 861,
    "723": 862,
    "1083": 863,
    "proper": 864,
    "closest": 865
  },
  "id2word": {
    "0": "pad",
    "1": "unk",
    "2": "what",
    "3": "is",
    "4": "the",
    "5": "cost",
    "6": "for",
    "7": "these",
    "8": "flights",
    "9": "from",
    "10": "baltimore",
    "11": "to",
    "12": "philadelphia",
    "13": "westchester",
    "14": "county",
    "15": "san",
    "16": "francisco",
    "17": "daily",
    "18": "i",
    "19": "would",
    "20": "like",
    "21": "a",
    "22": "flight",
    "23": "dallas",
    "24": "on",
    "25": "american",
    "26": "airlines",
    "27": "can",
    "28": "take",
    "29": "single",
    "30": "airline",
    "31": "la",
    "32": "charlotte",
    "33": "newark",
    "34": "back",
    "35": "earliest",
    "36": "oakland",
    "37": "washington",
    "38": "dc",
    "39": "sunday",
    "40": "'d",
    "41": "book",
    "42": "columbus",
    "43": "nashville",
    "44": "please",
    "45": "denver",
    "46": "pittsburgh",
    "47": "show",
    "48": "me",
    "49": "round",
    "50": "trip",
    "51": "tickets",
    "52": "new",
    "53": "york",
    "54": "miami",
    "55": "phoenix",
    "56": "las",
    "57": "vegas",
    "58": "find",
    "59": "cheapest",
    "60": "fare",
    "61": "atlanta",
    "62": "'s",
    "63": "latest",
    "64": "get",
    "65": "boston",
    "66": "arrival",
    "67": "in",
    "68": "salt",
    "69": "lake",
    "70": "city",
    "71": "of",
    "72": "toronto",
    "73": "list",
    "74": "nonstop",
    "75": "along",
    "76": "with",
    "77": "fares",
    "78": "that",
    "79": "are",
    "80": "less",
    "81": "than",
    "82": "466",
    "83": "dollars",
    "84": "all",
    "85": "between",
    "86": "and",
    "87": "coach",
    "88": "saturday",
    "89": "pm",
    "90": "continental",
    "91": "leaving",
    "92": "chicago",
    "93": "morning",
    "94": "hi",
    "95": "'m",
    "96": "calling",
    "97": "make",
    "98": "either",
    "99": "orlando",
    "100": "or",
    "101": "los",
    "102": "angeles",
    "103": "us",
    "104": "air",
    "105": "cleveland",
    "106": "arrives",
    "107": "around",
    "108": "10",
    "109": "o'clock",
    "110": "evening",
    "111": "need",
    "112": "lowest",
    "113": "give",
    "114": "memphis",
    "115": "time",
    "116": "zone",
    "117": "does",
    "118": "abbreviation",
    "119": "ua",
    "120": "mean",
    "121": "one",
    "122": "way",
    "123": "ground",
    "124": "transportation",
    "125": "available",
    "126": "at",
    "127": "airport",
    "128": "tacoma",
    "129": "jose",
    "130": "houston",
    "131": "will",
    "132": "car",
    "133": "twa",
    "134": "united",
    "135": "fly",
    "136": "fort",
    "137": "worth",
    "138": "leaves",
    "139": "after",
    "140": "8",
    "141": "going",
    "142": "november",
    "143": "seventh",
    "144": "monday",
    "145": "seating",
    "146": "capacity",
    "147": "f28",
    "148": "seattle",
    "149": "classes",
    "150": "service",
    "151": "provide",
    "152": "anywhere",
    "153": "arriving",
    "154": "2100",
    "155": "information",
    "156": "departing",
    "157": "thursday",
    "158": "before",
    "159": "9",
    "160": "am",
    "161": "dl",
    "162": "217",
    "163": "there",
    "164": "any",
    "165": "using",
    "166": "j31",
    "167": "aircraft",
    "168": "meal",
    "169": "milwaukee",
    "170": "wednesday",
    "171": "night",
    "172": "tuesday",
    "173": "afternoon",
    "174": "flying",
    "175": "want",
    "176": "see",
    "177": "you",
    "178": "delta",
    "179": "an",
    "180": "stopover",
    "181": "say",
    "182": "about",
    "183": "mealtime",
    "184": "arrive",
    "185": "noon",
    "186": "3",
    "187": "which",
    "188": "go",
    "189": "stop",
    "190": "making",
    "191": "both",
    "192": "direct",
    "193": "connecting",
    "194": "kansas",
    "195": "burbank",
    "196": "may",
    "197": "twenty",
    "198": "two",
    "199": "depart",
    "200": "7",
    "201": "could",
    "202": "general",
    "203": "mitchell",
    "204": "international",
    "205": "downtown",
    "206": "through",
    "207": "code",
    "208": "ff",
    "209": "next",
    "210": "do",
    "211": "747",
    "212": "first",
    "213": "into",
    "214": "march",
    "215": "last",
    "216": "restriction",
    "217": "ap",
    "218": "57",
    "219": "leave",
    "220": "early",
    "221": "tell",
    "222": "'ll",
    "223": "rent",
    "224": "know",
    "225": "price",
    "226": "class",
    "227": "seats",
    "228": "nw",
    "229": "weekday",
    "230": "indianapolis",
    "231": "5",
    "232": "6",
    "233": "so",
    "234": "when",
    "235": "have",
    "236": "maximum",
    "237": "amount",
    "238": "still",
    "239": "return",
    "240": "same",
    "241": "day",
    "242": "1700",
    "243": "only",
    "244": "weekdays",
    "245": "love",
    "246": "field",
    "247": "plane",
    "248": "grounds",
    "249": "st.",
    "250": "louis",
    "251": "paul",
    "252": "distance",
    "253": "guardia",
    "254": "prices",
    "255": "most",
    "256": "expensive",
    "257": "detroit",
    "258": "friday",
    "259": "qx",
    "260": "jersey",
    "261": "ap80",
    "262": "serves",
    "263": "august",
    "264": "sixth",
    "265": "where",
    "266": "each",
    "267": "1000",
    "268": "tampa",
    "269": "april",
    "270": "june",
    "271": "economy",
    "272": "thirty",
    "273": "number",
    "274": "again",
    "275": "dinner",
    "276": "looking",
    "277": "diego",
    "278": "1",
    "279": "now",
    "280": "fourth",
    "281": "breakfast",
    "282": "via",
    "283": "tomorrow",
    "284": "qo",
    "285": "no",
    "286": "week",
    "287": "lunch",
    "288": "hou",
    "289": "ac",
    "290": "as",
    "291": "explain",
    "292": "q",
    "293": "long",
    "294": "beach",
    "295": "how",
    "296": "many",
    "297": "yn",
    "298": "okay",
    "299": "just",
    "300": "takeoffs",
    "301": "landings",
    "302": "july",
    "303": "eighth",
    "304": "philly",
    "305": "ninth",
    "306": "serving",
    "307": "california",
    "308": "serve",
    "309": "12",
    "310": "4",
    "311": "fourteenth",
    "312": "makes",
    "313": "wednesdays",
    "314": "another",
    "315": "cincinnati",
    "316": "times",
    "317": "later",
    "318": "interested",
    "319": "should",
    "320": "be",
    "321": "kind",
    "322": "airplane",
    "323": "281",
    "324": "bwi",
    "325": "second",
    "326": "petersburg",
    "327": "types",
    "328": "today",
    "329": "colorado",
    "330": "pennsylvania",
    "331": "then",
    "332": "eleventh",
    "333": "more",
    "334": "stops",
    "335": "provided",
    "336": "by",
    "337": "travel",
    "338": "mia",
    "339": "but",
    "340": "ontario",
    "341": "limo",
    "342": "out",
    "343": "taxi",
    "344": "operation",
    "345": "230",
    "346": "texas",
    "347": "my",
    "348": "choices",
    "349": "your",
    "350": "1059",
    "351": "minneapolis",
    "352": "schedule",
    "353": "ticket",
    "354": "least",
    "355": "october",
    "356": "fifteenth",
    "357": "used",
    "358": "1222",
    "359": "america",
    "360": "west",
    "361": "southwest",
    "362": "sorry",
    "363": "271",
    "364": "hp",
    "365": "tower",
    "366": "fifth",
    "367": "restrictions",
    "368": "airfare",
    "369": "416",
    "370": "trying",
    "371": "eastern",
    "372": "838",
    "373": "1100",
    "374": "days",
    "375": "goes",
    "376": "sfo",
    "377": "ewr",
    "378": "december",
    "379": "sixteenth",
    "380": "if",
    "381": "possible",
    "382": "northwest",
    "383": "transport",
    "384": "live",
    "385": "montreal",
    "386": "home",
    "387": "numbers",
    "388": "six",
    "389": "qw",
    "390": "september",
    "391": "far",
    "392": "it",
    "393": "booking",
    "394": "k",
    "395": "415",
    "396": "other",
    "397": "airports",
    "398": "meals",
    "399": "services",
    "400": "cities",
    "401": "served",
    "402": "nationair",
    "403": "stopping",
    "404": "2",
    "405": "third",
    "406": "730",
    "407": "rental",
    "408": "rates",
    "409": "tenth",
    "410": "reaching",
    "411": "arrangements",
    "412": "stands",
    "413": "total",
    "414": "thank",
    "415": "sixteen",
    "416": "late",
    "417": "b",
    "418": "business",
    "419": "mco",
    "420": "stand",
    "421": "type",
    "422": "during",
    "423": "much",
    "424": "bay",
    "425": "area",
    "426": "lufthansa",
    "427": "1991",
    "428": "jet",
    "429": "run",
    "430": "jfk",
    "431": "shortest",
    "432": "without",
    "433": "720",
    "434": "smallest",
    "435": "flies",
    "436": "eight",
    "437": "limousine",
    "438": "thirtieth",
    "439": "mornings",
    "440": "645",
    "441": "thrift",
    "442": "month",
    "443": "departure",
    "444": "f",
    "445": "saturdays",
    "446": "right",
    "447": "c",
    "448": "takes",
    "449": "landing",
    "450": "823",
    "451": "124",
    "452": "402",
    "453": "fine",
    "454": "difference",
    "455": "costs",
    "456": "level",
    "457": "kinds",
    "458": "755",
    "459": "originate",
    "460": "destination",
    "461": "greatest",
    "462": "logan",
    "463": "seventeen",
    "464": "located",
    "465": "oak",
    "466": "atl",
    "467": "630",
    "468": "meaning",
    "469": "start",
    "470": "thanks",
    "471": "also",
    "472": "eighteenth",
    "473": "twelfth",
    "474": "boeing",
    "475": "737",
    "476": "display",
    "477": "laying",
    "478": "over",
    "479": "include",
    "480": "able",
    "481": "put",
    "482": "january",
    "483": "1992",
    "484": "h",
    "485": "heading",
    "486": "ls",
    "487": "different",
    "488": "offers",
    "489": "rentals",
    "490": "plan",
    "491": "codes",
    "492": "airplanes",
    "493": "name",
    "494": "options",
    "495": "noontime",
    "496": "has",
    "497": "canada",
    "498": "layover",
    "499": "trips",
    "500": "nineteenth",
    "501": "they",
    "502": "fn",
    "503": "across",
    "504": "this",
    "505": "continent",
    "506": "m80",
    "507": "cheap",
    "508": "coming",
    "509": "819",
    "510": "within",
    "511": "201",
    "512": "343",
    "513": "florida",
    "514": "schedules",
    "515": "aa",
    "516": "459",
    "517": "midnight",
    "518": "934",
    "519": "rate",
    "520": "hello",
    "521": "inform",
    "522": "sometime",
    "523": "1039",
    "524": "1024",
    "525": "currently",
    "526": "returning",
    "527": "co",
    "528": "continuing",
    "529": "buy",
    "530": "near",
    "531": "430",
    "532": "530",
    "533": "twentieth",
    "534": "arrange",
    "535": "friends",
    "536": "people",
    "537": "uses",
    "538": "wanted",
    "539": "let",
    "540": "iah",
    "541": "some",
    "542": "sure",
    "543": "determine",
    "544": "use",
    "545": "minnesota",
    "546": "852",
    "547": "80",
    "548": "economic",
    "549": "825",
    "550": "555",
    "551": "staying",
    "552": "hours",
    "553": "traveling",
    "554": "1145",
    "555": "their",
    "556": "following",
    "557": "local",
    "558": "equal",
    "559": "270",
    "560": "north",
    "561": "carolina",
    "562": "1115",
    "563": "1245",
    "564": "town",
    "565": "midwest",
    "566": "express",
    "567": "canadian",
    "568": "stopovers",
    "569": "requesting",
    "570": "here",
    "571": "11",
    "572": "offer",
    "573": "regarding",
    "574": "bring",
    "575": "up",
    "576": "turboprop",
    "577": "originating",
    "578": "order",
    "579": "yes",
    "580": "225",
    "581": "1158",
    "582": "equipment",
    "583": "arizona",
    "584": "arrivals",
    "585": "starting",
    "586": "names",
    "587": "1291",
    "588": "1220",
    "589": "snack",
    "590": "great",
    "591": "too",
    "592": "we",
    "593": "'re",
    "594": "nighttime",
    "595": "while",
    "596": "reservation",
    "597": "dfw",
    "598": "734",
    "599": "highest",
    "600": "130",
    "601": "connect",
    "602": "98",
    "603": "kindly",
    "604": "813",
    "605": "straight",
    "606": "110",
    "607": "y",
    "608": "look",
    "609": "listing",
    "610": "earlier",
    "611": "1017",
    "612": "2134",
    "613": "300",
    "614": "400",
    "615": "connections",
    "616": "seven",
    "617": "must",
    "618": "1026",
    "619": "approximately",
    "620": "cp",
    "621": "reservations",
    "622": "capacities",
    "623": "planes",
    "624": "february",
    "625": "twelve",
    "626": "nights",
    "627": "ea",
    "628": "212",
    "629": "100",
    "630": "nonstops",
    "631": "296",
    "632": "324",
    "633": "missouri",
    "634": "utah",
    "635": "those",
    "636": "210",
    "637": "very",
    "638": "help",
    "639": "provides",
    "640": "ohio",
    "641": "106",
    "642": "soon",
    "643": "tuesdays",
    "644": "stapleton",
    "645": "71",
    "646": "repeating",
    "647": "define",
    "648": "ord",
    "649": "269",
    "650": "1600",
    "651": "quebec",
    "652": "describe",
    "653": "red",
    "654": "eye",
    "655": "tonight",
    "656": "ap68",
    "657": "845",
    "658": "dc10",
    "659": "dulles",
    "660": "767",
    "661": "1993",
    "662": "'ve",
    "663": "got",
    "664": "somebody",
    "665": "else",
    "666": "who",
    "667": "wants",
    "668": "305",
    "669": "s",
    "670": "designate",
    "671": "seventeenth",
    "672": "concerning",
    "673": "eleven",
    "674": "carried",
    "675": "under",
    "676": "771",
    "677": "begins",
    "678": "lands",
    "679": "55",
    "680": "summer",
    "681": "overnight",
    "682": "spend",
    "683": "lastest",
    "684": "three",
    "685": "650",
    "686": "itinerary",
    "687": "departs",
    "688": "qualify",
    "689": "417",
    "690": "150",
    "691": "2153",
    "692": "cars",
    "693": "1300",
    "694": "repeat",
    "695": "represented",
    "696": "database",
    "697": "four",
    "698": "257",
    "699": "oh",
    "700": "ten",
    "701": "thursdays",
    "702": "329",
    "703": "ap57",
    "704": "0900",
    "705": "815",
    "706": "cover",
    "707": "minimum",
    "708": "connection",
    "709": "intercontinental",
    "710": "planning",
    "711": "fit",
    "712": "72s",
    "713": "420",
    "714": "georgia",
    "715": "serviced",
    "716": "question",
    "717": "thereafter",
    "718": "travels",
    "719": "73s",
    "720": "everywhere",
    "721": "sd",
    "722": "d",
    "723": "advertises",
    "724": "having",
    "725": "3357",
    "726": "705",
    "727": "thing",
    "728": "bur",
    "729": "taking",
    "730": "off",
    "731": "passengers",
    "732": "hold",
    "733": "500",
    "734": "airfares",
    "735": "4400",
    "736": "year",
    "737": "932",
    "738": "757",
    "739": "abbreviations",
    "740": "19",
    "741": "wish",
    "742": "discount",
    "743": "date",
    "744": "497766",
    "745": "1020",
    "746": "21",
    "747": "beginning",
    "748": "doesn",
    "749": "'t",
    "750": "sa",
    "751": "close",
    "752": "departures",
    "753": "carries",
    "754": "733",
    "755": "311",
    "756": "priced",
    "757": "midway",
    "758": "indiana",
    "759": "279",
    "760": "137338",
    "761": "nevada",
    "762": "non",
    "763": "alaska",
    "764": "1110",
    "765": "718",
    "766": "various",
    "767": "746",
    "768": "d9s",
    "769": "1940",
    "770": "listed",
    "771": "1055",
    "772": "405",
    "773": "scheduled",
    "774": "usa",
    "775": "such",
    "776": "615",
    "777": "land",
    "778": "sundays",
    "779": "prefer",
    "780": "d10",
    "781": "o",
    "782": "'hare",
    "783": "fridays",
    "784": "dinnertime",
    "785": "bound",
    "786": "well",
    "787": "try",
    "788": "1205",
    "789": "train",
    "790": "being",
    "791": "actually",
    "792": "445",
    "793": "515",
    "794": "takeoff",
    "795": "seat",
    "796": "preferably",
    "797": "directly",
    "798": "82",
    "799": "139",
    "800": "visit",
    "801": "them",
    "802": "lives",
    "803": "1045",
    "804": "enroute",
    "805": "largest",
    "806": "m",
    "807": "428",
    "808": "transcontinental",
    "809": "anything",
    "810": "listings",
    "811": "come",
    "812": "lester",
    "813": "pearson",
    "814": "longest",
    "815": "michigan",
    "816": "1765",
    "817": "352",
    "818": "toward",
    "819": "companies",
    "820": "vicinity",
    "821": "connects",
    "822": "supper",
    "823": "505",
    "824": "163",
    "825": "hopefully",
    "826": "928",
    "827": "final",
    "828": "thirteenth",
    "829": "besides",
    "830": "1850",
    "831": "symbols",
    "832": "limousines",
    "833": "route",
    "834": "once",
    "835": "includes",
    "836": "323",
    "837": "229",
    "838": "runs",
    "839": "1133",
    "840": "43",
    "841": "315",
    "842": "bna",
    "843": "1505",
    "844": "3724",
    "845": "reaches",
    "846": "including",
    "847": "afternoons",
    "848": "working",
    "849": "scenario",
    "850": "727",
    "851": "1500",
    "852": "539",
    "853": "trans",
    "854": "world",
    "855": "1030",
    "856": "1130",
    "857": "tennessee",
    "858": "sounds",
    "859": "reverse",
    "860": "sort",
    "861": "afterwards",
    "862": "723",
    "863": "1083",
    "864": "proper",
    "865": "closest"
  },
  "intent2id": {
    "flight_time": 0,
    "airline+flight_no": 1,
    "meal": 2,
    "airfare": 3,
    "ground_service+ground_fare": 4,
    "flight_no": 5,
    "ground_service": 6,
    "abbreviation": 7,
    "distance": 8,
    "airport": 9,
    "day_name": 10,
    "aircraft": 11,
    "airfare+flight": 12,
    "flight+airline": 13,
    "capacity": 14,
    "restriction": 15,
    "flight+airfare": 16,
    "flight": 17,
    "quantity": 18,
    "aircraft+flight+flight_no": 19,
    "flight_no+airline": 20,
    "airline": 21,
    "city": 22,
    "cheapest": 23,
    "airfare+flight_time": 24,
    "ground_fare": 25
  },
  "id2intent": {
    "0": "flight_time",
    "1": "airline+flight_no",
    "2": "meal",
    "3": "airfare",
    "4": "ground_service+ground_fare",
    "5": "flight_no",
    "6": "ground_service",
    "7": "abbreviation",
    "8": "distance",
    "9": "airport",
    "10": "day_name",
    "11": "aircraft",
    "12": "airfare+flight",
    "13": "flight+airline",
    "14": "capacity",
    "15": "restriction",
    "16": "flight+airfare",
    "17": "flight",
    "18": "quantity",
    "19": "aircraft+flight+flight_no",
    "20": "flight_no+airline",
    "21": "airline",
    "22": "city",
    "23": "cheapest",
    "24": "airfare+flight_time",
    "25": "ground_fare"
  },
  "slot2id": {
    "pad": 0,
    "B-airline_name": 1,
    "I-arrive_time.time_relative": 2,
    "B-toloc.state_name": 3,
    "B-arrive_date.today_relative": 4,
    "B-arrive_time.start_time": 5,
    "I-depart_date.day_number": 6,
    "B-fromloc.state_code": 7,
    "B-return_time.period_of_day": 8,
    "I-restriction_code": 9,
    "B-economy": 10,
    "B-meal_description": 11,
    "B-airport_code": 12,
    "I-flight_number": 13,
    "B-depart_date.day_name": 14,
    "I-depart_date.day_name": 15,
    "B-stoploc.state_code": 16,
    "B-city_name": 17,
    "B-arrive_time.period_mod": 18,
    "B-airline_code": 19,
    "I-meal_code": 20,
    "B-toloc.state_code": 21,
    "I-toloc.city_name": 22,
    "I-depart_time.time": 23,
    "B-stoploc.city_name": 24,
    "B-return_date.day_name": 25,
    "B-class_type": 26,
    "I-flight_stop": 27,
    "I-depart_time.period_of_day": 28,
    "B-days_code": 29,
    "I-fromloc.city_name": 30,
    "B-fare_amount": 31,
    "I-depart_time.time_relative": 32,
    "B-depart_date.month_name": 33,
    "B-aircraft_code": 34,
    "B-arrive_time.period_of_day": 35,
    "B-stoploc.airport_name": 36,
    "B-arrive_date.month_name": 37,
    "B-toloc.country_name": 38,
    "I-depart_time.start_time": 39,
    "B-flight_number": 40,
    "B-stoploc.airport_code": 41,
    "B-meal_code": 42,
    "I-airline_name": 43,
    "I-mod": 44,
    "I-return_date.day_number": 45,
    "I-arrive_time.end_time": 46,
    "B-flight_mod": 47,
    "I-round_trip": 48,
    "B-flight_days": 49,
    "B-state_name": 50,
    "B-depart_date.year": 51,
    "B-arrive_date.date_relative": 52,
    "B-meal": 53,
    "I-fromloc.state_name": 54,
    "B-fromloc.state_name": 55,
    "I-depart_date.today_relative": 56,
    "B-depart_date.day_number": 57,
    "B-mod": 58,
    "I-class_type": 59,
    "B-depart_date.date_relative": 60,
    "I-airport_name": 61,
    "B-toloc.airport_code": 62,
    "B-toloc.airport_name": 63,
    "B-fromloc.airport_code": 64,
    "B-return_date.today_relative": 65,
    "I-stoploc.city_name": 66,
    "I-economy": 67,
    "B-depart_time.period_mod": 68,
    "B-today_relative": 69,
    "B-flight_stop": 70,
    "I-fare_basis_code": 71,
    "B-return_date.date_relative": 72,
    "B-return_time.period_mod": 73,
    "I-city_name": 74,
    "B-round_trip": 75,
    "B-restriction_code": 76,
    "B-booking_class": 77,
    "B-flight_time": 78,
    "B-arrive_time.end_time": 79,
    "I-flight_time": 80,
    "B-transport_type": 81,
    "B-toloc.city_name": 82,
    "I-arrive_time.period_of_day": 83,
    "B-time": 84,
    "I-depart_time.end_time": 85,
    "B-or": 86,
    "B-fromloc.airport_name": 87,
    "B-depart_time.time": 88,
    "I-fromloc.airport_name": 89,
    "B-cost_relative": 90,
    "B-arrive_time.time": 91,
    "I-return_date.date_relative": 92,
    "I-flight_mod": 93,
    "I-toloc.state_name": 94,
    "B-arrive_date.day_number": 95,
    "I-arrive_date.day_number": 96,
    "B-arrive_time.time_relative": 97,
    "B-return_date.day_number": 98,
    "B-day_name": 99,
    "B-compartment": 100,
    "I-arrive_time.start_time": 101,
    "I-return_date.today_relative": 102,
    "B-month_name": 103,
    "I-fare_amount": 104,
    "B-depart_time.end_time": 105,
    "B-depart_date.today_relative": 106,
    "I-time": 107,
    "O": 108,
    "B-depart_time.start_time": 109,
    "B-time_relative": 110,
    "I-state_name": 111,
    "B-state_code": 112,
    "I-arrive_time.time": 113,
    "B-arrive_date.day_name": 114,
    "B-day_number": 115,
    "B-connect": 116,
    "I-meal_description": 117,
    "B-fromloc.city_name": 118,
    "B-depart_time.time_relative": 119,
    "B-depart_time.period_of_day": 120,
    "B-return_date.month_name": 121,
    "I-cost_relative": 122,
    "I-transport_type": 123,
    "I-today_relative": 124,
    "B-airport_name": 125,
    "I-toloc.airport_name": 126,
    "B-period_of_day": 127,
    "B-fare_basis_code": 128,
    "B-flight": 129
  },
  "id2slot": {
    "0": "pad",
    "1": "B-airline_name",
    "2": "I-arrive_time.time_relative",
    "3": "B-toloc.state_name",
    "4": "B-arrive_date.today_relative",
    "5": "B-arrive_time.start_time",
    "6": "I-depart_date.day_number",
    "7": "B-fromloc.state_code",
    "8": "B-return_time.period_of_day",
    "9": "I-restriction_code",
    "10": "B-economy",
    "11": "B-meal_description",
    "12": "B-airport_code",
    "13": "I-flight_number",
    "14": "B-depart_date.day_name",
    "15": "I-depart_date.day_name",
    "16": "B-stoploc.state_code",
    "17": "B-city_name",
    "18": "B-arrive_time.period_mod",
    "19": "B-airline_code",
    "20": "I-meal_code",
    "21": "B-toloc.state_code",
    "22": "I-toloc.city_name",
    "23": "I-depart_time.time",
    "24": "B-stoploc.city_name",
    "25": "B-return_date.day_name",
    "26": "B-class_type",
    "27": "I-flight_stop",
    "28": "I-depart_time.period_of_day",
    "29": "B-days_code",
    "30": "I-fromloc.city_name",
    "31": "B-fare_amount",
    "32": "I-depart_time.time_relative",
    "33": "B-depart_date.month_name",
    "34": "B-aircraft_code",
    "35": "B-arrive_time.period_of_day",
    "36": "B-stoploc.airport_name",
    "37": "B-arrive_date.month_name",
    "38": "B-toloc.country_name",
    "39": "I-depart_time.start_time",
    "40": "B-flight_number",
    "41": "B-stoploc.airport_code",
    "42": "B-meal_code",
    "43": "I-airline_name",
    "44": "I-mod",
    "45": "I-return_date.day_number",
    "46": "I-arrive_time.end_time",
    "47": "B-flight_mod",
    "48": "I-round_trip",
    "49": "B-flight_days",
    "50": "B-state_name",
    "51": "B-depart_date.year",
    "52": "B-arrive_date.date_relative",
    "53": "B-meal",
    "54": "I-fromloc.state_name",
    "55": "B-fromloc.state_name",
    "56": "I-depart_date.today_relative",
    "57": "B-depart_date.day_number",
    "58": "B-mod",
    "59": "I-class_type",
    "60": "B-depart_date.date_relative",
    "61": "I-airport_name",
    "62": "B-toloc.airport_code",
    "63": "B-toloc.airport_name",
    "64": "B-fromloc.airport_code",
    "65": "B-return_date.today_relative",
    "66": "I-stoploc.city_name",
    "67": "I-economy",
    "68": "B-depart_time.period_mod",
    "69": "B-today_relative",
    "70": "B-flight_stop",
    "71": "I-fare_basis_code",
    "72": "B-return_date.date_relative",
    "73": "B-return_time.period_mod",
    "74": "I-city_name",
    "75": "B-round_trip",
    "76": "B-restriction_code",
    "77": "B-booking_class",
    "78": "B-flight_time",
    "79": "B-arrive_time.end_time",
    "80": "I-flight_time",
    "81": "B-transport_type",
    "82": "B-toloc.city_name",
    "83": "I-arrive_time.period_of_day",
    "84": "B-time",
    "85": "I-depart_time.end_time",
    "86": "B-or",
    "87": "B-fromloc.airport_name",
    "88": "B-depart_time.time",
    "89": "I-fromloc.airport_name",
    "90": "B-cost_relative",
    "91": "B-arrive_time.time",
    "92": "I-return_date.date_relative",
    "93": "I-flight_mod",
    "94": "I-toloc.state_name",
    "95": "B-arrive_date.day_number",
    "96": "I-arrive_date.day_number",
    "97": "B-arrive_time.time_relative",
    "98": "B-return_date.day_number",
    "99": "B-day_name",
    "100": "B-compartment",
    "101": "I-arrive_time.start_time",
    "102": "I-return_date.today_relative",
    "103": "B-month_name",
    "104": "I-fare_amount",
    "105": "B-depart_time.end_time",
    "106": "B-depart_date.today_relative",
    "107": "I-time",
    "108": "O",
    "109": "B-depart_time.start_time",
    "110": "B-time_relative",
    "111": "I-state_name",
    "112": "B-state_code",
    "113": "I-arrive_time.time",
    "114": "B-arrive_date.day_name",
    "115": "B-day_number",
    "116": "B-connect",
    "117": "I-meal_description",
    "118": "B-fromloc.city_name",
    "119": "B-depart_time.time_relative",
    "120": "B-depart_time.period_of_day",
    "121": "B-return_date.month_name",
    "122": "I-cost_relative",
    "123": "I-transport_type",
    "124": "I-today_relative",
    "125": "B-airport_name",
    "126": "I-toloc.airport_name",
    "127": "B-period_of_day",
    "128": "B-fare_basis_code",
    "129": "B-flight"
  },
  "pad_token": 0
}